# Multy Index Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
# 나쁜 예
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [ ]:
# MultyIndex 지정
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [4]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [5]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

## extra dimension

In [6]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [7]:
# pop_df.stack()

In [8]:
pop_df =  pd.DataFrame({'total' : pop, 'under18' : [9267089, 9284094, 4687374, 4318033, 5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [17]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

year            2000      2010
state
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

# MultyIndex 생성 방법

In [10]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.010180  0.159901
  2  0.152473  0.207790
b 1  0.084739  0.058672
  2  0.492045  0.890854

In [11]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

## 인덱스 이름

In [12]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## Columns MultiIndex

In [13]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      51.0  35.9  48.0  37.5  31.0  36.7
     2      41.0  36.4  39.0  37.9  27.0  37.5
2014 1      34.0  37.9  37.0  35.9  41.0  36.0
     2      17.0  37.5  27.0  37.3  51.0  36.6

In [18]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      48.0  37.5
     2      39.0  37.9
2014 1      37.0  35.9
     2      27.0  37.3

# MultiIndex의 Indexing & Slicing

In [19]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [24]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [27]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [29]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [30]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

## DataFrame Index 곱하기

In [31]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      51.0  35.9  48.0  37.5  31.0  36.7
     2      41.0  36.4  39.0  37.9  27.0  37.5
2014 1      34.0  37.9  37.0  35.9  41.0  36.0
     2      17.0  37.5  27.0  37.3  51.0  36.6

In [32]:
health_data['Guido', 'HR']

year  visit
2013  1        48.0
      2        39.0
2014  1        37.0
      2        27.0
Name: (Guido, HR), dtype: float64

In [14]:
health_data.loc[:, ('Bob', 'HR')].unstack()

visit     1     2
year
2013   51.0  41.0
2014   34.0  17.0

In [15]:
health_data['Bob', 'HR'].unstack()

visit     1     2
year
2013   51.0  41.0
2014   34.0  17.0

In [41]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      51.0  48.0  31.0
2014 1      34.0  37.0  41.0

# Rearranging Multi Index

In [81]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.701171
      2      0.956401
c     1      0.036170
      2      0.698423
b     1      0.536201
      2      0.111252
dtype: float64

In [82]:
data = data.sort_index()
data

char  int
a     1      0.701171
      2      0.956401
b     1      0.536201
      2      0.111252
c     1      0.036170
      2      0.698423
dtype: float64

In [83]:
data['a':'b']

char  int
a     1      0.701171
      2      0.956401
b     1      0.536201
      2      0.111252
dtype: float64

In [84]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [85]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

## Index setting and resetting

In [86]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [87]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

# Data Aggregations

In [88]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      51.0  35.9  48.0  37.5  31.0  36.7
     2      41.0  36.4  39.0  37.9  27.0  37.5
2014 1      34.0  37.9  37.0  35.9  41.0  36.0
     2      17.0  37.5  27.0  37.3  51.0  36.6

In [89]:
data_mean = health_data.mean(level='year')
data_mean

TypeError: mean() got an unexpected keyword argument 'level'

In [90]:
data_mean.mean(axis=1, level='type')

NameError: name 'data_mean' is not defined